Revit 2027 API
gbXMLSurfaceType Enumeration
 This enumeration corresponds to the surfaceType attribute in gbXML and identifies the type of surface defined.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum gbXMLSurfaceType
Public Enumeration gbXMLSurfaceType
public enum class gbXMLSurfaceType
type gbXMLSurfaceType
Members
Member name | Value | Description
Ceiling | 8 |  Ceiling.
ExposedFloor | 4 |  Exposed floor.
ExteriorWall | 1 |  Exterior wall.
InteriorFloor | 3 |  Interior floor.
InteriorWall | 0 |  Interior wall.
NoOfSurfaceTypes | 13 |  No of surface types.
RaisedFloor | 11 |  Raised floor.
Roof | 2 |  Roof.
Shade | 5 |  Shade.
SlabOnGrade | 12 |  Slab on grade.
SurfaceAir | 9 |  Surface air.
UndergroundCeiling | 10 |  Underground ceiling.
UndergroundSlab | 7 |  Underground slab.
UndergroundWall | 6 |  Underground wall.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace